Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
#include "ESP32S3BoxLite.h"

#include <algorithm>
#include <cmath>
#include <cstring>
#include <cstdio>
#include <cstdarg>

#include "driver/i2c.h"
#include "driver/i2s.h"
#include "esp_sleep.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_heap_caps.h"
#include "SPIFFS.h"

namespace {

// ---------------------------------------------------------------------------
// Pin definitions
// ---------------------------------------------------------------------------

constexpr int kLcdMosiPin      = 6;
constexpr int kLcdClkPin       = 7;
constexpr int kLcdCsPin        = 5;
constexpr int kLcdDcPin        = 4;
constexpr int kLcdRstPin       = 48;
constexpr int kLcdBacklightPin = 45;

constexpr int kI2cPort    = I2C_NUM_0;
constexpr int kI2cSdaPin  = 8;
constexpr int kI2cSclPin  = 18;

constexpr int kI2sPort        = I2S_NUM_0;
constexpr int kI2sBclkPin     = 17;
constexpr int kI2sMclkPin     = 2;
constexpr int kI2sWsPin       = 47;
constexpr int kI2sDataOutPin  = 15;
constexpr int kI2sDataInPin   = 16;
constexpr int kPowerAmpPin    = 46;

constexpr int kConfigButtonPin = 0;
constexpr int kAdcButtonPin    = 1;

// ---------------------------------------------------------------------------
// Button ADC thresholds
// ---------------------------------------------------------------------------

constexpr int kButtonNextMinMv  = 720;
constexpr int kButtonNextMaxMv  = 920;
constexpr int kButtonEnterMinMv = 1880;
constexpr int kButtonEnterMaxMv = 2080;
constexpr int kButtonPrevMinMv  = 2310;
constexpr int kButtonPrevMaxMv  = 2510;
constexpr int kDebounceMs       = 25;

// ---------------------------------------------------------------------------
// Audio constants
// ---------------------------------------------------------------------------

constexpr uint32_t kDefaultSampleRate = 22050;
constexpr float    kPi = 3.14159265358979323846f;

constexpr uint8_t kEs8156Address  = 0x10;
constexpr uint8_t kEs7243eAddress = 0x20;

// ---------------------------------------------------------------------------
// LEDC backlight channel
// ---------------------------------------------------------------------------

constexpr int kBacklightLedcChannel = 0;

// ---------------------------------------------------------------------------
// NVS namespace
// ---------------------------------------------------------------------------

constexpr char kNvsNamespace[] = "esp32box";

// ---------------------------------------------------------------------------
// 5x7 pixel font (uppercase A-Z, digits, symbols, and lowercase a-z)
// ---------------------------------------------------------------------------

struct Glyph {
  char    ch;
  uint8_t rows[7];
};

constexpr Glyph kGlyphs[] = {
    // Special characters
    {' ',  {0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b00000}},
    {'-',  {0b00000, 0b00000, 0b00000, 0b11111, 0b00000, 0b00000, 0b00000}},
    {'.',  {0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b00110, 0b00110}},
    {':',  {0b00000, 0b00110, 0b00110, 0b00000, 0b00110, 0b00110, 0b00000}},
    {'!',  {0b00100, 0b00100, 0b00100, 0b00100, 0b00100, 0b00000, 0b00100}},
    {'?',  {0b01110, 0b10001, 0b00001, 0b00010, 0b00100, 0b00000, 0b00100}},
    {'/',  {0b00001, 0b00010, 0b00100, 0b00100, 0b01000, 0b10000, 0b10000}},
    {'_',  {0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b11111}},
    {'(',  {0b00010, 0b00100, 0b01000, 0b01000, 0b01000, 0b00100, 0b00010}},
    {')',  {0b01000, 0b00100, 0b00010, 0b00010, 0b00010, 0b00100, 0b01000}},
    {'%',  {0b11000, 0b11001, 0b00010, 0b00100, 0b01000, 0b10011, 0b00011}},
    {'+',  {0b00000, 0b00100, 0b00100, 0b11111, 0b00100, 0b00100, 0b00000}},
    {'=',  {0b00000, 0b00000, 0b11111, 0b00000, 0b11111, 0b00000, 0b00000}},
    // Digits
    {'0',  {0b01110, 0b10001, 0b10011, 0b10101, 0b11001, 0b10001, 0b01110}},
    {'1',  {0b00100, 0b01100, 0b00100, 0b00100, 0b00100, 0b00100, 0b01110}},
    {'2',  {0b01110, 0b10001, 0b00001, 0b00010, 0b00100, 0b01000, 0b11111}},
    {'3',  {0b11110, 0b00001, 0b00001, 0b01110, 0b00001, 0b00001, 0b11110}},
    {'4',  {0b00010, 0b00110, 0b01010, 0b10010, 0b11111, 0b00010, 0b00010}},
    {'5',  {0b11111, 0b10000, 0b10000, 0b11110, 0b00001, 0b00001, 0b11110}},
    {'6',  {0b00110, 0b01000, 0b10000, 0b11110, 0b10001, 0b10001, 0b01110}},
    {'7',  {0b11111, 0b00001, 0b00010, 0b00100, 0b01000, 0b01000, 0b01000}},
    {'8',  {0b01110, 0b10001, 0b10001, 0b01110, 0b10001, 0b10001, 0b01110}},
    {'9',  {0b01110, 0b10001, 0b10001, 0b01111, 0b00001, 0b00010, 0b11100}},
    // Uppercase A-Z
    {'A',  {0b01110, 0b10001, 0b10001, 0b11111, 0b10001, 0b10001, 0b10001}},
    {'B',  {0b11110, 0b10001, 0b10001, 0b11110, 0b10001, 0b10001, 0b11110}},
    {'C',  {0b01110, 0b10001, 0b10000, 0b10000, 0b10000, 0b10001, 0b01110}},
    {'D',  {0b11100, 0b10010, 0b10001, 0b10001, 0b10001, 0b10010, 0b11100}},
    {'E',  {0b11111, 0b10000, 0b10000, 0b11110, 0b10000, 0b10000, 0b11111}},
    {'F',  {0b11111, 0b10000, 0b10000, 0b11110, 0b10000, 0b10000, 0b10000}},
    {'G',  {0b01110, 0b10001, 0b10000, 0b10111, 0b10001, 0b10001, 0b01110}},
    {'H',  {0b10001, 0b10001, 0b10001, 0b11111, 0b10001, 0b10001, 0b10001}},
    {'I',  {0b11111, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100, 0b11111}},
    {'J',  {0b11111, 0b00010, 0b00010, 0b00010, 0b00010, 0b10010, 0b01100}},
    {'K',  {0b10001, 0b10010, 0b10100, 0b11000, 0b10100, 0b10010, 0b10001}},
    {'L',  {0b10000, 0b10000, 0b10000, 0b10000, 0b10000, 0b10000, 0b11111}},
    {'M',  {0b10001, 0b11011, 0b10101, 0b10101, 0b10001, 0b10001, 0b10001}},
    {'N',  {0b10001, 0b10001, 0b11001, 0b10101, 0b10011, 0b10001, 0b10001}},
    {'O',  {0b01110, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b01110}},
    {'P',  {0b11110, 0b10001, 0b10001, 0b11110, 0b10000, 0b10000, 0b10000}},
    {'Q',  {0b01110, 0b10001, 0b10001, 0b10001, 0b10101, 0b10010, 0b01101}},
    {'R',  {0b11110, 0b10001, 0b10001, 0b11110, 0b10100, 0b10010, 0b10001}},
    {'S',  {0b01111, 0b10000, 0b10000, 0b01110, 0b00001, 0b00001, 0b11110}},
    {'T',  {0b11111, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100}},
    {'U',  {0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b01110}},
    {'V',  {0b10001, 0b10001, 0b10001, 0b10001, 0b01010, 0b01010, 0b00100}},
    {'W',  {0b10001, 0b10001, 0b10001, 0b10101, 0b10101, 0b11011, 0b10001}},
    {'X',  {0b10001, 0b01010, 0b00100, 0b00100, 0b00100, 0b01010, 0b10001}},
    {'Y',  {0b10001, 0b01010, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100}},
    {'Z',  {0b11111, 0b00010, 0b00100, 0b00100, 0b01000, 0b10000, 0b11111}},
    // Lowercase a-z
    {'a',  {0b00000, 0b00000, 0b01110, 0b00001, 0b01111, 0b10001, 0b01111}},
    {'b',  {0b10000, 0b10000, 0b10110, 0b11001, 0b10001, 0b10001, 0b11110}},
    {'c',  {0b00000, 0b00000, 0b01110, 0b10001, 0b10000, 0b10001, 0b01110}},
    {'d',  {0b00001, 0b00001, 0b01101, 0b10011, 0b10001, 0b10001, 0b01111}},
    {'e',  {0b00000, 0b00000, 0b01110, 0b10001, 0b11111, 0b10000, 0b01110}},
    {'f',  {0b00110, 0b01001, 0b01000, 0b11100, 0b01000, 0b01000, 0b01000}},
    {'g',  {0b00000, 0b01111, 0b10001, 0b10001, 0b01111, 0b00001, 0b01110}},
    {'h',  {0b10000, 0b10000, 0b10110, 0b11001, 0b10001, 0b10001, 0b10001}},
    {'i',  {0b00100, 0b00000, 0b01100, 0b00100, 0b00100, 0b00100, 0b01110}},
    {'j',  {0b00010, 0b00000, 0b00110, 0b00010, 0b00010, 0b10010, 0b01100}},
    {'k',  {0b10000, 0b10000, 0b10010, 0b10100, 0b11000, 0b10100, 0b10010}},
    {'l',  {0b01100, 0b00100, 0b00100, 0b00100, 0b00100, 0b00100, 0b01110}},
    {'m',  {0b00000, 0b00000, 0b11010, 0b10101, 0b10101, 0b10001, 0b10001}},
    {'n',  {0b00000, 0b00000, 0b10110, 0b11001, 0b10001, 0b10001, 0b10001}},
    {'o',  {0b00000, 0b00000, 0b01110, 0b10001, 0b10001, 0b10001, 0b01110}},
    {'p',  {0b00000, 0b11110, 0b10001, 0b10001, 0b11110, 0b10000, 0b10000}},
    {'q',  {0b00000, 0b01111, 0b10001, 0b10001, 0b01111, 0b00001, 0b00001}},
    {'r',  {0b00000, 0b00000, 0b10110, 0b11001, 0b10000, 0b10000, 0b10000}},
    {'s',  {0b00000, 0b00000, 0b01111, 0b10000, 0b01110, 0b00001, 0b11110}},
    {'t',  {0b01000, 0b01000, 0b11100, 0b01000, 0b01000, 0b01001, 0b00110}},
    {'u',  {0b00000, 0b00000, 0b10001, 0b10001, 0b10001, 0b10011, 0b01101}},
    {'v',  {0b00000, 0b00000, 0b10001, 0b10001, 0b01010, 0b01010, 0b00100}},
    {'w',  {0b00000, 0b00000, 0b10001, 0b10101, 0b10101, 0b10101, 0b01010}},
    {'x',  {0b00000, 0b00000, 0b10001, 0b01010, 0b00100, 0b01010, 0b10001}},
    {'y',  {0b00000, 0b10001, 0b10001, 0b01111, 0b00001, 0b10001, 0b01110}},
    {'z',  {0b00000, 0b00000, 0b11111, 0b00010, 0b00100, 0b01000, 0b11111}},
};

const Glyph *findGlyph(char ch) {
  for (const auto &glyph : kGlyphs) {
    if (glyph.ch == ch) {
      return &glyph;
    }
  }
  return &kGlyphs[0];  // fallback to space
}

// ---------------------------------------------------------------------------
// WAV header parsing helpers (Phase 4)
// ---------------------------------------------------------------------------

struct WavHeader {
  uint32_t sampleRate;
  uint16_t numChannels;
  uint16_t bitsPerSample;
  uint32_t dataOffset;
  uint32_t dataSize;
  bool     valid;
};

WavHeader parseWavHeader(const uint8_t *data, size_t len) {
  WavHeader h{};
  if (len < 44) {
    return h;
  }
  // Check RIFF
  if (data[0] != 'R' || data[1] != 'I' || data[2] != 'F' || data[3] != 'F') {
    return h;
  }
  // Check WAVE
  if (data[8] != 'W' || data[9] != 'A' || data[10] != 'V' || data[11] != 'E') {
    return h;
  }

