Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
  // Scan for fmt  and data chunks
  size_t offset = 12;
  bool fmtFound = false;
  bool dataFound = false;

  while (offset + 8 <= len) {
    uint32_t chunkId = (uint32_t)data[offset] | ((uint32_t)data[offset + 1] << 8) |
                       ((uint32_t)data[offset + 2] << 16) | ((uint32_t)data[offset + 3] << 24);
    uint32_t chunkSize = (uint32_t)data[offset + 4] | ((uint32_t)data[offset + 5] << 8) |
                         ((uint32_t)data[offset + 6] << 16) | ((uint32_t)data[offset + 7] << 24);

    // "fmt "
    if (chunkId == 0x20746D66u) {
      if (offset + 8 + 16 > len) {
        break;
      }
      // audioFormat = data[offset+8] | data[offset+9]<<8  (should be 1 for PCM)
      h.numChannels  = (uint16_t)data[offset + 10] | ((uint16_t)data[offset + 11] << 8);
      h.sampleRate   = (uint32_t)data[offset + 12] | ((uint32_t)data[offset + 13] << 8) |
                       ((uint32_t)data[offset + 14] << 16) | ((uint32_t)data[offset + 15] << 24);
      h.bitsPerSample = (uint16_t)data[offset + 22] | ((uint16_t)data[offset + 23] << 8);
      fmtFound = true;
    }
    // "data"
    else if (chunkId == 0x61746164u) {
      h.dataOffset = static_cast<uint32_t>(offset + 8);
      h.dataSize   = chunkSize;
      dataFound = true;
    }

    offset += 8 + chunkSize;
    // Align to 2-byte boundary
    if (chunkSize & 1) {
      offset++;
    }
  }

  h.valid = fmtFound && dataFound;
  return h;
}

// ---------------------------------------------------------------------------
// WAV file write helper for SPIFFS (Phase 5)
// ---------------------------------------------------------------------------

bool writeWavFile(File &f, const int16_t *samples, size_t count, uint32_t sampleRate) {
  const uint32_t dataBytes = static_cast<uint32_t>(count) * 2U;
  const uint32_t riffSize  = 36U + dataBytes;

  // RIFF header
  const uint8_t riff[] = {'R', 'I', 'F', 'F'};
  f.write(riff, 4);
  uint8_t size4[4];
  size4[0] = riffSize & 0xFF;
  size4[1] = (riffSize >> 8) & 0xFF;
  size4[2] = (riffSize >> 16) & 0xFF;
  size4[3] = (riffSize >> 24) & 0xFF;
  f.write(size4, 4);
  const uint8_t wave[] = {'W', 'A', 'V', 'E'};
  f.write(wave, 4);

  // fmt chunk
  const uint8_t fmt[] = {'f', 'm', 't', ' '};
  f.write(fmt, 4);
  // chunk size = 16
  const uint8_t fmtSize[] = {16, 0, 0, 0};
  f.write(fmtSize, 4);
  // PCM = 1
  const uint8_t audioFmt[] = {1, 0};
  f.write(audioFmt, 2);
  // channels = 1 (mono)
  const uint8_t channels[] = {1, 0};
  f.write(channels, 2);
  // sample rate
  uint8_t sr[4];
  sr[0] = sampleRate & 0xFF;
  sr[1] = (sampleRate >> 8) & 0xFF;
  sr[2] = (sampleRate >> 16) & 0xFF;
  sr[3] = (sampleRate >> 24) & 0xFF;
  f.write(sr, 4);
  // byte rate = sampleRate * channels * bitsPerSample/8 = sampleRate * 2
  const uint32_t byteRate = sampleRate * 2U;
  uint8_t br[4];
  br[0] = byteRate & 0xFF;
  br[1] = (byteRate >> 8) & 0xFF;
  br[2] = (byteRate >> 16) & 0xFF;
  br[3] = (byteRate >> 24) & 0xFF;
  f.write(br, 4);
  // block align = 2
  const uint8_t blockAlign[] = {2, 0};
  f.write(blockAlign, 2);
  // bits per sample = 16
  const uint8_t bps[] = {16, 0};
  f.write(bps, 2);

  // data chunk
  const uint8_t dataId[] = {'d', 'a', 't', 'a'};
  f.write(dataId, 4);
  uint8_t ds[4];
  ds[0] = dataBytes & 0xFF;
  ds[1] = (dataBytes >> 8) & 0xFF;
  ds[2] = (dataBytes >> 16) & 0xFF;
  ds[3] = (dataBytes >> 24) & 0xFF;
  f.write(ds, 4);

  // PCM samples
  f.write(reinterpret_cast<const uint8_t *>(samples), dataBytes);
  return true;
}

}  // namespace

// ===========================================================================
// ESP32S3BoxLiteDisplay implementation
// ===========================================================================

bool ESP32S3BoxLiteDisplay::begin() {
  pinMode(kLcdCsPin, OUTPUT);
  pinMode(kLcdDcPin, OUTPUT);
  pinMode(kLcdRstPin, OUTPUT);
  pinMode(kLcdBacklightPin, OUTPUT);

  digitalWrite(kLcdCsPin, HIGH);
  digitalWrite(kLcdDcPin, HIGH);
  // Backlight off during init
  digitalWrite(kLcdBacklightPin, LOW);

  spi_.begin(kLcdClkPin, -1, kLcdMosiPin, kLcdCsPin);
  spi_.beginTransaction(SPISettings(10000000, MSBFIRST, SPI_MODE0));

  digitalWrite(kLcdRstPin, HIGH);
  delay(50);
  digitalWrite(kLcdRstPin, LOW);
  delay(50);
  digitalWrite(kLcdRstPin, HIGH);
  delay(150);

  writeCommand(0x01);
  delay(150);

  const uint8_t porch[] = {0x0C, 0x0C, 0x00, 0x33, 0x33};
  writeCommandWithData(0xB2, porch, sizeof(porch));

  const uint8_t gateCtrl[] = {0x35};
  writeCommandWithData(0xB7, gateCtrl, sizeof(gateCtrl));

  const uint8_t vcoms[] = {0x28};
  writeCommandWithData(0xBB, vcoms, sizeof(vcoms));

  const uint8_t lcmCtrl[] = {0x0C};
  writeCommandWithData(0xC0, lcmCtrl, sizeof(lcmCtrl));

  const uint8_t vdvVrhEn[] = {0x01, 0xFF};
  writeCommandWithData(0xC2, vdvVrhEn, sizeof(vdvVrhEn));

  const uint8_t vrhs[] = {0x10};
  writeCommandWithData(0xC3, vrhs, sizeof(vrhs));

  const uint8_t vdvs[] = {0x20};
  writeCommandWithData(0xC4, vdvs, sizeof(vdvs));

  const uint8_t frameRate[] = {0x0F};
  writeCommandWithData(0xC6, frameRate, sizeof(frameRate));

  const uint8_t powerCtrl[] = {0xA4, 0xA1};
  writeCommandWithData(0xD0, powerCtrl, sizeof(powerCtrl));

  const uint8_t positiveGamma[] = {
      0xD0, 0x00, 0x02, 0x07, 0x0A, 0x28, 0x32, 0x44,
      0x42, 0x06, 0x0E, 0x12, 0x14, 0x17,
  };
  writeCommandWithData(0xE0, positiveGamma, sizeof(positiveGamma));

  const uint8_t negativeGamma[] = {
      0xD0, 0x00, 0x02, 0x07, 0x0A, 0x28, 0x31, 0x54,
      0x47, 0x0E, 0x1C, 0x17, 0x1B, 0x1E,
  };
  writeCommandWithData(0xE1, negativeGamma, sizeof(negativeGamma));

  const uint8_t colorMode[] = {0x55};
  writeCommandWithData(0x3A, colorMode, sizeof(colorMode));

  const uint8_t madctl[] = {0xA0};
  writeCommandWithData(0x36, madctl, sizeof(madctl));

  writeCommand(0x21);
  writeCommand(0x11);
  delay(120);
  writeCommand(0x13);
  writeCommand(0x29);
  delay(50);

  // Turn on backlight at 100%
  setBacklight(100);
  initialized_ = true;
  return true;
}

void ESP32S3BoxLiteDisplay::setBacklight(uint8_t percent) {
  if (!backlightPwmSetup_) {
    ledcSetup(kBacklightLedcChannel, 5000, 8);
    ledcAttachPin(kLcdBacklightPin, kBacklightLedcChannel);
    backlightPwmSetup_ = true;
  }
  const uint8_t duty = static_cast<uint8_t>((static_cast<uint16_t>(percent > 100 ? 100 : percent) * 255U) / 100U);
  ledcWrite(kBacklightLedcChannel, duty);
}

void ESP32S3BoxLiteDisplay::writeCommand(uint8_t command) {
  digitalWrite(kLcdDcPin, LOW);
  digitalWrite(kLcdCsPin, LOW);
  spi_.write(command);
  digitalWrite(kLcdCsPin, HIGH);
}

void ESP32S3BoxLiteDisplay::writeData(const uint8_t *data, size_t length) {
  digitalWrite(kLcdDcPin, HIGH);
  digitalWrite(kLcdCsPin, LOW);
  spi_.writeBytes(data, length);
  digitalWrite(kLcdCsPin, HIGH);
}

void ESP32S3BoxLiteDisplay::writeCommandWithData(uint8_t command, const uint8_t *data, size_t length) {
  writeCommand(command);
  writeData(data, length);
}

void ESP32S3BoxLiteDisplay::setAddressWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
  uint8_t data[4];

  writeCommand(0x2A);
  data[0] = x0 >> 8;
  data[1] = x0 & 0xFF;
  data[2] = x1 >> 8;
  data[3] = x1 & 0xFF;
  writeData(data, sizeof(data));

  writeCommand(0x2B);
  data[0] = y0 >> 8;
  data[1] = y0 & 0xFF;
  data[2] = y1 >> 8;
  data[3] = y1 & 0xFF;
  writeData(data, sizeof(data));

  writeCommand(0x2C);
}

void ESP32S3BoxLiteDisplay::setAddressWindowPublic(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
  setAddressWindow(x0, y0, x1, y1);
}

