Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
void ESP32S3BoxLiteDisplay::sendRawBuffer(const uint8_t *buf, size_t len) {
  digitalWrite(kLcdDcPin, HIGH);
  digitalWrite(kLcdCsPin, LOW);
  spi_.writeBytes(buf, len);
  digitalWrite(kLcdCsPin, HIGH);
}

void ESP32S3BoxLiteDisplay::sendColor(uint16_t color, uint32_t count) {
  uint8_t buffer[128];
  for (size_t i = 0; i < sizeof(buffer); i += 2) {
    buffer[i]     = color >> 8;
    buffer[i + 1] = color & 0xFF;
  }

  digitalWrite(kLcdDcPin, HIGH);
  digitalWrite(kLcdCsPin, LOW);
  while (count > 0) {
    const uint32_t chunkPixels = std::min<uint32_t>(count, sizeof(buffer) / 2);
    spi_.writeBytes(buffer, chunkPixels * 2);
    count -= chunkPixels;
  }
  digitalWrite(kLcdCsPin, HIGH);
}

void ESP32S3BoxLiteDisplay::fillRect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color) {
  if (!initialized_ || x >= Width || y >= Height || w == 0 || h == 0) {
    return;
  }
  if (x + w > Width)  { w = Width  - x; }
  if (y + h > Height) { h = Height - y; }

  setAddressWindow(x, y, x + w - 1, y + h - 1);
  sendColor(color, static_cast<uint32_t>(w) * h);
}

void ESP32S3BoxLiteDisplay::fillScreen(uint16_t color) {
  fillRect(0, 0, Width, Height, color);
}

void ESP32S3BoxLiteDisplay::drawPixel(int16_t x, int16_t y, uint16_t color) {
  if (!initialized_ || x < 0 || y < 0 || x >= static_cast<int16_t>(Width) || y >= static_cast<int16_t>(Height)) {
    return;
  }
  fillRect(static_cast<uint16_t>(x), static_cast<uint16_t>(y), 1, 1, color);
}

void ESP32S3BoxLiteDisplay::drawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color) {
  // Bresenham's line algorithm
  int16_t dx  =  std::abs(x1 - x0);
  int16_t dy  = -std::abs(y1 - y0);
  int16_t sx  = x0 < x1 ? 1 : -1;
  int16_t sy  = y0 < y1 ? 1 : -1;
  int16_t err = dx + dy;

  while (true) {
    drawPixel(x0, y0, color);
    if (x0 == x1 && y0 == y1) {
      break;
    }
    int16_t e2 = 2 * err;
    if (e2 >= dy) {
      if (x0 == x1) { break; }
      err += dy;
      x0  += sx;
    }
    if (e2 <= dx) {
      if (y0 == y1) { break; }
      err += dx;
      y0  += sy;
    }
  }
}

void ESP32S3BoxLiteDisplay::drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
  if (w <= 0 || h <= 0) { return; }
  drawLine(x,         y,         x + w - 1, y,         color);  // top
  drawLine(x,         y + h - 1, x + w - 1, y + h - 1, color);  // bottom
  drawLine(x,         y,         x,         y + h - 1, color);  // left
  drawLine(x + w - 1, y,         x + w - 1, y + h - 1, color);  // right
}

void ESP32S3BoxLiteDisplay::drawCircle(int16_t cx, int16_t cy, int16_t r, uint16_t color) {
  // Bresenham's circle algorithm
  int16_t x = 0;
  int16_t y = r;
  int16_t d = 3 - 2 * r;

  auto plot = [&]() {
    drawPixel(cx + x, cy + y, color);
    drawPixel(cx - x, cy + y, color);
    drawPixel(cx + x, cy - y, color);
    drawPixel(cx - x, cy - y, color);
    drawPixel(cx + y, cy + x, color);
    drawPixel(cx - y, cy + x, color);
    drawPixel(cx + y, cy - x, color);
    drawPixel(cx - y, cy - x, color);
  };

  while (y >= x) {
    plot();
    ++x;
    if (d > 0) {
      --y;
      d += 4 * (x - y) + 10;
    } else {
      d += 4 * x + 6;
    }
  }
}

void ESP32S3BoxLiteDisplay::fillCircle(int16_t cx, int16_t cy, int16_t r, uint16_t color) {
  int16_t x = 0;
  int16_t y = r;
  int16_t d = 3 - 2 * r;

  auto hline = [&](int16_t ax, int16_t bx, int16_t row) {
    if (ax > bx) { int16_t t = ax; ax = bx; bx = t; }
    if (ax < 0)  { ax = 0; }
    if (bx >= static_cast<int16_t>(Width)) { bx = static_cast<int16_t>(Width) - 1; }
    if (row < 0 || row >= static_cast<int16_t>(Height)) { return; }
    fillRect(static_cast<uint16_t>(ax), static_cast<uint16_t>(row),
             static_cast<uint16_t>(bx - ax + 1), 1, color);
  };

  while (y >= x) {
    hline(cx - x, cx + x, cy + y);
    hline(cx - x, cx + x, cy - y);
    hline(cx - y, cx + y, cy + x);
    hline(cx - y, cx + y, cy - x);
    ++x;
    if (d > 0) {
      --y;
      d += 4 * (x - y) + 10;
    } else {
      d += 4 * x + 6;
    }
  }
}

void ESP32S3BoxLiteDisplay::drawBitmap(int16_t x, int16_t y, const uint8_t *bitmap,
                                        int16_t w, int16_t h, uint16_t fgColor, uint16_t bgColor) {
  if (!initialized_ || bitmap == nullptr || w <= 0 || h <= 0) {
    return;
  }
  const int16_t bytesPerRow = (w + 7) / 8;
  for (int16_t row = 0; row < h; ++row) {
    for (int16_t col = 0; col < w; ++col) {
      const int16_t byteIdx = row * bytesPerRow + col / 8;
      const uint8_t bitMask = 0x80 >> (col % 8);
      const bool    on      = bitmap[byteIdx] & bitMask;
      drawPixel(x + col, y + row, on ? fgColor : bgColor);
    }
  }
}

void ESP32S3BoxLiteDisplay::drawRGBBitmap(int16_t x, int16_t y, const uint16_t *bitmap, int16_t w, int16_t h) {
  if (!initialized_ || bitmap == nullptr || w <= 0 || h <= 0) {
    return;
  }
  // Clip
  if (x >= static_cast<int16_t>(Width) || y >= static_cast<int16_t>(Height)) {
    return;
  }
  // We send row by row to handle potential clipping
  setAddressWindow(
      static_cast<uint16_t>(std::max<int16_t>(x, 0)),
      static_cast<uint16_t>(std::max<int16_t>(y, 0)),
      static_cast<uint16_t>(std::min<int16_t>(x + w - 1, static_cast<int16_t>(Width)  - 1)),
      static_cast<uint16_t>(std::min<int16_t>(y + h - 1, static_cast<int16_t>(Height) - 1)));

  // Send pixel data (big-endian RGB565)
  constexpr size_t kBufPixels = 64;
  uint8_t buf[kBufPixels * 2];
  size_t bufIdx = 0;

  auto flush = [&]() {
    if (bufIdx > 0) {
      sendRawBuffer(buf, bufIdx);
      bufIdx = 0;
    }
  };

  digitalWrite(kLcdDcPin, HIGH);
  digitalWrite(kLcdCsPin, LOW);
  for (int16_t row = 0; row < h; ++row) {
    if (y + row < 0 || y + row >= static_cast<int16_t>(Height)) { continue; }
    for (int16_t col = 0; col < w; ++col) {
      if (x + col < 0 || x + col >= static_cast<int16_t>(Width)) { continue; }
      const uint16_t px = bitmap[row * w + col];
      buf[bufIdx++] = px >> 8;
      buf[bufIdx++] = px & 0xFF;
      if (bufIdx >= sizeof(buf)) {
        spi_.writeBytes(buf, bufIdx);
        bufIdx = 0;
      }
    }
  }
  if (bufIdx > 0) {
    spi_.writeBytes(buf, bufIdx);
  }
  digitalWrite(kLcdCsPin, HIGH);
}

void ESP32S3BoxLiteDisplay::drawProgressBar(int16_t x, int16_t y, int16_t w, int16_t h,
                                              uint8_t percent, uint16_t fgColor, uint16_t bgColor) {
  if (!initialized_ || w <= 0 || h <= 0) {
    return;
  }
  const uint8_t clampedPct = percent > 100 ? 100 : percent;
  // Background
  fillRect(static_cast<uint16_t>(x), static_cast<uint16_t>(y),
           static_cast<uint16_t>(w), static_cast<uint16_t>(h), bgColor);
  // Foreground fill
  const int16_t fillW = static_cast<int16_t>((static_cast<int32_t>(w) * clampedPct) / 100);
  if (fillW > 0) {
    fillRect(static_cast<uint16_t>(x), static_cast<uint16_t>(y),
             static_cast<uint16_t>(fillW), static_cast<uint16_t>(h), fgColor);
  }
}

void ESP32S3BoxLiteDisplay::printf(int16_t x, int16_t y, uint8_t scale, uint16_t fg, uint16_t bg, const char *fmt, ...) {
  char buf[128];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buf, sizeof(buf), fmt, args);
  va_end(args);
  drawText(x, y, buf, scale, fg, bg);
}

void ESP32S3BoxLiteDisplay::drawGlyph(int16_t x, int16_t y, char ch, uint8_t scale, uint16_t fg, uint16_t bg) {
  const Glyph *glyph = findGlyph(ch);
  for (uint8_t row = 0; row < 7; ++row) {
    for (uint8_t col = 0; col < 5; ++col) {
      const bool on = glyph->rows[row] & (1 << (4 - col));
      fillRect(static_cast<uint16_t>(x + col * scale), static_cast<uint16_t>(y + row * scale),
               scale, scale, on ? fg : bg);
    }
  }
}

void ESP32S3BoxLiteDisplay::drawText(int16_t x, int16_t y, const char *text, uint8_t scale, uint16_t fg, uint16_t bg) {
  if (scale == 0) { scale = 1; }
  const int16_t charWidth = 6 * scale;
  for (size_t i = 0; text[i] != '\0'; ++i) {
    drawGlyph(x, y, text[i], scale, fg, bg);
    x += charWidth;
  }
}

void ESP32S3BoxLiteDisplay::drawTextCentered(int16_t y, const char *text, uint8_t scale, uint16_t fg, uint16_t bg) {
  if (scale == 0) { scale = 1; }
  const size_t  len       = strlen(text);
  const int16_t charWidth = 6 * scale;
  const int16_t textWidth = static_cast<int16_t>(len) * charWidth - scale;
  const int16_t x         = (Width - textWidth) / 2;
  drawText(x, y, text, scale, fg, bg);
}

