Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
// Phase 7 - UI helpers

void ESP32S3BoxLiteDisplay::showMessage(const char *text, uint16_t bgColor) {
  if (!initialized_) { return; }
  fillScreen(bgColor);

  // Split text into lines at '\n' or auto-wrap at ~26 chars per line (scale=1)
  // We'll use scale=2 for readability, wrap at 13 chars (Width/12 = ~26 pixels per char)
  constexpr uint8_t kScale = 2;
  constexpr int16_t kMaxCharsPerLine = (Width - 20) / (6 * kScale);
  constexpr int16_t kLineHeight = 7 * kScale + 4;

  char lineBuf[64];
  size_t len = strlen(text);
  int16_t curY = (Height - kLineHeight * ((int16_t)((len + kMaxCharsPerLine - 1) / kMaxCharsPerLine))) / 2;
  if (curY < 4) { curY = 4; }

  size_t pos = 0;
  while (pos < len) {
    size_t end = pos + kMaxCharsPerLine;
    if (end > len) { end = len; }
    // Try to break at space
    if (end < len && text[end] != ' ') {
      size_t breakAt = end;
      while (breakAt > pos && text[breakAt] != ' ') { --breakAt; }
      if (breakAt > pos) { end = breakAt; }
    }
    const size_t lineLen = end - pos;
    memcpy(lineBuf, text + pos, lineLen);
    lineBuf[lineLen] = '\0';
    drawTextCentered(curY, lineBuf, kScale, ColorWhite, bgColor);
    curY += kLineHeight;
    pos = end;
    if (pos < len && text[pos] == ' ') { ++pos; }
  }
}

void ESP32S3BoxLiteDisplay::showError(const char *text) {
  showMessage(text, ColorRed);
}

void ESP32S3BoxLiteDisplay::showBootScreen(const char *appName, const char *version) {
  if (!initialized_) { return; }
  fillScreen(ColorBlack);

  // Title bar
  fillRect(0, 0, Width, 50, ColorBlue);
  drawTextCentered(16, appName, 2, ColorWhite, ColorBlue);

  // Version
  drawTextCentered(70, version, 1, ColorCyan, ColorBlack);

  // Divider
  fillRect(20, 90, Width - 40, 2, ColorGray);

  // Progress bar animation placeholder
  drawProgressBar(20, 110, Width - 40, 16, 100, ColorGreen, ColorGray);
  drawTextCentered(140, "Initializing...", 1, ColorWhite, ColorBlack);
}

void ESP32S3BoxLiteDisplay::drawStatusBar(const char *left, const char *right, uint16_t bgColor) {
  if (!initialized_) { return; }
  constexpr uint16_t kBarHeight = 16;
  fillRect(0, 0, Width, kBarHeight, bgColor);
  drawText(4, 4, left, 1, ColorWhite, bgColor);

  // Right-align the right string
  const size_t  rLen  = strlen(right);
  const int16_t rX    = static_cast<int16_t>(Width) - static_cast<int16_t>(rLen) * 6 - 4;
  drawText(rX, 4, right, 1, ColorWhite, bgColor);
}

// ===========================================================================
// ESP32S3BoxLiteSprite implementation
// ===========================================================================

bool ESP32S3BoxLiteSprite::createSprite(int16_t w, int16_t h) {
  deleteSprite();
  if (w <= 0 || h <= 0) { return false; }
  const size_t bytes = static_cast<size_t>(w) * static_cast<size_t>(h) * 2U;

  // Try PSRAM first, then regular heap
  if (esp_spiram_is_initialized()) {
    buffer_ = static_cast<uint16_t *>(heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  }
  if (buffer_ == nullptr) {
    buffer_ = static_cast<uint16_t *>(heap_caps_malloc(bytes, MALLOC_CAP_8BIT));
  }
  if (buffer_ == nullptr) { return false; }

  w_ = w;
  h_ = h;
  memset(buffer_, 0, bytes);
  return true;
}

void ESP32S3BoxLiteSprite::deleteSprite() {
  if (buffer_ != nullptr) {
    heap_caps_free(buffer_);
    buffer_ = nullptr;
  }
  w_ = 0;
  h_ = 0;
}

void ESP32S3BoxLiteSprite::fillScreen(uint16_t color) {
  if (buffer_ == nullptr) { return; }
  const int32_t total = static_cast<int32_t>(w_) * h_;
  for (int32_t i = 0; i < total; ++i) {
    buffer_[i] = color;
  }
}

void ESP32S3BoxLiteSprite::fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
  if (buffer_ == nullptr || w <= 0 || h <= 0) { return; }
  for (int16_t row = y; row < y + h; ++row) {
    if (row < 0 || row >= h_) { continue; }
    for (int16_t col = x; col < x + w; ++col) {
      if (col < 0 || col >= w_) { continue; }
      buffer_[row * w_ + col] = color;
    }
  }
}

void ESP32S3BoxLiteSprite::drawPixel(int16_t x, int16_t y, uint16_t color) {
  if (buffer_ == nullptr || x < 0 || y < 0 || x >= w_ || y >= h_) { return; }
  buffer_[y * w_ + x] = color;
}

void ESP32S3BoxLiteSprite::drawText(int16_t x, int16_t y, const char *text, uint8_t scale,
                                     uint16_t fg, uint16_t bg) {
  if (buffer_ == nullptr || text == nullptr) { return; }
  if (scale == 0) { scale = 1; }
  // Find glyphs and draw into buffer
  const int16_t charWidth = 6 * scale;
  int16_t cx = x;
  for (size_t i = 0; text[i] != '\0'; ++i) {
    const Glyph *glyph = findGlyph(text[i]);
    for (uint8_t row = 0; row < 7; ++row) {
      for (uint8_t col = 0; col < 5; ++col) {
        const bool on    = glyph->rows[row] & (1 << (4 - col));
        const uint16_t c = on ? fg : bg;
        for (uint8_t sy = 0; sy < scale; ++sy) {
          for (uint8_t sx = 0; sx < scale; ++sx) {
            drawPixel(cx + col * scale + sx, y + row * scale + sy, c);
          }
        }
      }
    }
    cx += charWidth;
  }
}

void ESP32S3BoxLiteSprite::pushSprite(ESP32S3BoxLiteDisplay &disp, int16_t x, int16_t y) {
  if (buffer_ == nullptr || w_ <= 0 || h_ <= 0) { return; }

  // Clip to display bounds
  const int16_t dispW = static_cast<int16_t>(ESP32S3BoxLiteDisplay::Width);
  const int16_t dispH = static_cast<int16_t>(ESP32S3BoxLiteDisplay::Height);

  int16_t srcX = 0, srcY = 0;
  int16_t dstX = x, dstY = y;
  int16_t copyW = w_, copyH = h_;

  if (dstX < 0) { srcX -= dstX; copyW += dstX; dstX = 0; }
  if (dstY < 0) { srcY -= dstY; copyH += dstY; dstY = 0; }
  if (dstX + copyW > dispW) { copyW = dispW - dstX; }
  if (dstY + copyH > dispH) { copyH = dispH - dstY; }

  if (copyW <= 0 || copyH <= 0) { return; }

  disp.setAddressWindowPublic(
      static_cast<uint16_t>(dstX), static_cast<uint16_t>(dstY),
      static_cast<uint16_t>(dstX + copyW - 1), static_cast<uint16_t>(dstY + copyH - 1));

  // Send row by row (convert from native uint16 to big-endian bytes)
  constexpr size_t kBufPixels = 128;
  uint8_t txBuf[kBufPixels * 2];
  size_t  bufIdx = 0;

  // We need to send via the public raw buffer method
  // Accumulate into txBuf and flush when full
  auto sendBuf = [&](size_t count) {
    disp.sendRawBuffer(txBuf, count);
    bufIdx = 0;
  };

