Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
  for (int16_t row = 0; row < copyH; ++row) {
    for (int16_t col = 0; col < copyW; ++col) {
      const uint16_t px = buffer_[(srcY + row) * w_ + (srcX + col)];
      txBuf[bufIdx++] = px >> 8;
      txBuf[bufIdx++] = px & 0xFF;
      if (bufIdx >= sizeof(txBuf)) {
        sendBuf(bufIdx);
      }
    }
  }
  if (bufIdx > 0) {
    sendBuf(bufIdx);
  }
}

// ===========================================================================
// ESP32S3BoxLiteInput implementation
// ===========================================================================

bool ESP32S3BoxLiteInput::begin() {
  pinMode(kConfigButtonPin, INPUT_PULLUP);
  analogReadResolution(12);
  analogSetPinAttenuation(kAdcButtonPin, ADC_11db);
  return true;
}

ESP32S3BoxLiteButton ESP32S3BoxLiteInput::readRawButton() {
  if (digitalRead(kConfigButtonPin) == LOW) {
    lastAdcMilliVolts_ = 0;
    return ESP32S3BoxLiteButton::Config;
  }

  lastAdcMilliVolts_ = static_cast<int>(analogReadMilliVolts(kAdcButtonPin));
  if (lastAdcMilliVolts_ >= kButtonPrevMinMv  && lastAdcMilliVolts_ <= kButtonPrevMaxMv)  { return ESP32S3BoxLiteButton::Prev;   }
  if (lastAdcMilliVolts_ >= kButtonEnterMinMv && lastAdcMilliVolts_ <= kButtonEnterMaxMv) { return ESP32S3BoxLiteButton::Enter;  }
  if (lastAdcMilliVolts_ >= kButtonNextMinMv  && lastAdcMilliVolts_ <= kButtonNextMaxMv)  { return ESP32S3BoxLiteButton::Next;   }
  return ESP32S3BoxLiteButton::None;
}

ESP32S3BoxLiteButton ESP32S3BoxLiteInput::pollButtonEvent() {
  const uint32_t now = millis();
  const ESP32S3BoxLiteButton sample = readRawButton();

  if (sample != lastSample_) {
    lastSample_          = sample;
    debounceStartedMs_   = now;
  }

  if (sample != stableButton_ && (now - debounceStartedMs_) >= kDebounceMs) {
    stableButton_ = sample;
    if (stableButton_ != ESP32S3BoxLiteButton::None) {
      return stableButton_;
    }
  }
  return ESP32S3BoxLiteButton::None;
}

int ESP32S3BoxLiteInput::lastAdcMilliVolts() const {
  return lastAdcMilliVolts_;
}

const char *ESP32S3BoxLiteInput::buttonName(ESP32S3BoxLiteButton button) {
  switch (button) {
    case ESP32S3BoxLiteButton::Config: return "CFG";
    case ESP32S3BoxLiteButton::Prev:   return "PRV";
    case ESP32S3BoxLiteButton::Enter:  return "ENT";
    case ESP32S3BoxLiteButton::Next:   return "NXT";
    case ESP32S3BoxLiteButton::None:
    default:                           return "NONE";
  }
}

// Phase 3 additions

int ESP32S3BoxLiteInput::buttonIndex(ESP32S3BoxLiteButton btn) {
  return static_cast<int>(btn);  // None=0, Config=1, Prev=2, Enter=3, Next=4
}

void ESP32S3BoxLiteInput::setLongPressThresholdMs(uint32_t ms) {
  longPressThresholdMs_ = ms;
}

ButtonEvent ESP32S3BoxLiteInput::pollButtonEventEx() {
  const uint32_t now = millis();
  const ESP32S3BoxLiteButton sample = readRawButton();

  // Debounce
  if (sample != lastSample_) {
    lastSample_        = sample;
    debounceStartedMs_ = now;
  }

  if (sample != stableButton_ && (now - debounceStartedMs_) >= kDebounceMs) {
    const ESP32S3BoxLiteButton prev = stableButton_;
    stableButton_ = sample;

    if (prev == ESP32S3BoxLiteButton::None && stableButton_ != ESP32S3BoxLiteButton::None) {
      // Press started
      pressStartMs_        = now;
      longPressReported_   = false;
      currentPressedBtn_   = stableButton_;

      // Track double-click
      const int idx = buttonIndex(currentPressedBtn_);
      if (idx >= 0 && idx < 5) {
        lastClickMs_[idx] = now;
      }

      if (buttonCallback_) {
        buttonCallback_(currentPressedBtn_, ButtonEvent::Pressed);
      }
      return ButtonEvent::Pressed;
    }

    if (prev != ESP32S3BoxLiteButton::None && stableButton_ == ESP32S3BoxLiteButton::None) {
      // Released
      const ESP32S3BoxLiteButton released = prev;
      currentPressedBtn_ = ESP32S3BoxLiteButton::None;
      if (buttonCallback_) {
        buttonCallback_(released, ButtonEvent::Released);
      }
      return ButtonEvent::Released;
    }
  }

  // Check for long press while still held
  if (stableButton_ != ESP32S3BoxLiteButton::None && !longPressReported_) {
    if ((now - pressStartMs_) >= longPressThresholdMs_) {
      longPressReported_ = true;
      if (buttonCallback_) {
        buttonCallback_(stableButton_, ButtonEvent::LongPressed);
      }
      return ButtonEvent::LongPressed;
    }
  }

  return ButtonEvent::None;
}

bool ESP32S3BoxLiteInput::isDoubleClick(ESP32S3BoxLiteButton btn) {
  const int idx = buttonIndex(btn);
  if (idx < 0 || idx >= 5) { return false; }

  const uint32_t now = millis();
  const uint32_t last = lastClickMs_[idx];
  if (last == 0) { return false; }

  const uint32_t delta = now - last;
  // Window: must be between debounce time and 400ms
  return (delta > static_cast<uint32_t>(kDebounceMs)) && (delta < 400U);
}

void ESP32S3BoxLiteInput::setButtonCallback(void (*cb)(ESP32S3BoxLiteButton, ButtonEvent)) {
  buttonCallback_ = cb;
}

ESP32S3BoxLiteButton ESP32S3BoxLiteInput::waitForButton(uint32_t timeoutMs) {
  const uint32_t startMs = millis();
  while (true) {
    const uint32_t now = millis();
    if (timeoutMs > 0 && (now - startMs) >= timeoutMs) {
      return ESP32S3BoxLiteButton::None;
    }
    const ESP32S3BoxLiteButton btn = pollButtonEvent();
    if (btn != ESP32S3BoxLiteButton::None) {
      return btn;
    }
    delay(5);
  }
}

// ===========================================================================
// ESP32S3BoxLiteAudio implementation
// ===========================================================================

bool ESP32S3BoxLiteAudio::begin() {
  if (initialized_) { return true; }

  pinMode(kPowerAmpPin, OUTPUT);
  digitalWrite(kPowerAmpPin, LOW);

  if (!initI2cBus() || !initI2sBus() || !initEs8156() || !startEs8156() || !initEs7243e()) {
    return false;
  }
  if (!setSpeakerVolumePercent(volumePercent_) || !setMicGainDb(micGainDb_)) {
    return false;
  }

  initialized_ = true;
  return true;
}

bool ESP32S3BoxLiteAudio::ready() const {
  return initialized_;
}

uint32_t ESP32S3BoxLiteAudio::sampleRate() const {
  return currentSampleRate_;
}

bool ESP32S3BoxLiteAudio::initI2cBus() {
  i2c_config_t config = {};
  config.mode             = I2C_MODE_MASTER;
  config.sda_io_num       = static_cast<gpio_num_t>(kI2cSdaPin);
  config.scl_io_num       = static_cast<gpio_num_t>(kI2cSclPin);
  config.sda_pullup_en    = GPIO_PULLUP_ENABLE;
  config.scl_pullup_en    = GPIO_PULLUP_ENABLE;
  config.master.clk_speed = 100000;

  esp_err_t err = i2c_param_config(static_cast<i2c_port_t>(kI2cPort), &config);
  if (err != ESP_OK) { return false; }
  err = i2c_driver_install(static_cast<i2c_port_t>(kI2cPort), config.mode, 0, 0, 0);
  return err == ESP_OK || err == ESP_ERR_INVALID_STATE;
}

bool ESP32S3BoxLiteAudio::initI2sBus() {
  i2s_config_t config = {};
  config.mode                = static_cast<i2s_mode_t>(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_RX);
  config.sample_rate         = currentSampleRate_;
  config.bits_per_sample     = I2S_BITS_PER_SAMPLE_16BIT;
  config.channel_format      = I2S_CHANNEL_FMT_ONLY_LEFT;
  config.communication_format = I2S_COMM_FORMAT_STAND_I2S;
  config.intr_alloc_flags    = ESP_INTR_FLAG_LEVEL2 | ESP_INTR_FLAG_IRAM;
  config.dma_buf_count       = 3;
  config.dma_buf_len         = 1024;
  config.use_apll            = true;
  config.tx_desc_auto_clear  = true;
  config.fixed_mclk          = 0;

