Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
  esp_err_t err = i2s_driver_install(static_cast<i2s_port_t>(kI2sPort), &config, 0, nullptr);
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) { return false; }

  i2s_pin_config_t pins = {};
  pins.mck_io_num      = static_cast<gpio_num_t>(kI2sMclkPin);
  pins.bck_io_num      = static_cast<gpio_num_t>(kI2sBclkPin);
  pins.ws_io_num       = static_cast<gpio_num_t>(kI2sWsPin);
  pins.data_out_num    = static_cast<gpio_num_t>(kI2sDataOutPin);
  pins.data_in_num     = static_cast<gpio_num_t>(kI2sDataInPin);

  err = i2s_set_pin(static_cast<i2s_port_t>(kI2sPort), &pins);
  if (err != ESP_OK) { return false; }

  err = i2s_zero_dma_buffer(static_cast<i2s_port_t>(kI2sPort));
  return err == ESP_OK;
}

bool ESP32S3BoxLiteAudio::reinitI2sBus() {
  i2s_driver_uninstall(static_cast<i2s_port_t>(kI2sPort));
  return initI2sBus();
}

bool ESP32S3BoxLiteAudio::writeRegister(uint8_t deviceAddress, uint8_t reg, uint8_t value) {
  i2c_cmd_handle_t cmd = i2c_cmd_link_create();
  if (cmd == nullptr) { return false; }

  esp_err_t err = ESP_OK;
  err |= i2c_master_start(cmd);
  err |= i2c_master_write_byte(cmd, deviceAddress, true);
  err |= i2c_master_write_byte(cmd, reg, true);
  err |= i2c_master_write_byte(cmd, value, true);
  err |= i2c_master_stop(cmd);
  err |= i2c_master_cmd_begin(static_cast<i2c_port_t>(kI2cPort), cmd, pdMS_TO_TICKS(100));
  i2c_cmd_link_delete(cmd);
  return err == ESP_OK;
}

bool ESP32S3BoxLiteAudio::readRegister(uint8_t deviceAddress, uint8_t reg, uint8_t &value) {
  i2c_cmd_handle_t cmd = i2c_cmd_link_create();
  if (cmd == nullptr) { return false; }

  esp_err_t err = ESP_OK;
  err |= i2c_master_start(cmd);
  err |= i2c_master_write_byte(cmd, deviceAddress, true);
  err |= i2c_master_write_byte(cmd, reg, true);
  err |= i2c_master_stop(cmd);
  err |= i2c_master_cmd_begin(static_cast<i2c_port_t>(kI2cPort), cmd, pdMS_TO_TICKS(100));
  i2c_cmd_link_delete(cmd);
  if (err != ESP_OK) { return false; }

  cmd = i2c_cmd_link_create();
  if (cmd == nullptr) { return false; }

  err = ESP_OK;
  err |= i2c_master_start(cmd);
  err |= i2c_master_write_byte(cmd, deviceAddress | 0x01, true);
  err |= i2c_master_read_byte(cmd, &value, I2C_MASTER_LAST_NACK);
  err |= i2c_master_stop(cmd);
  err |= i2c_master_cmd_begin(static_cast<i2c_port_t>(kI2cPort), cmd, pdMS_TO_TICKS(100));
  i2c_cmd_link_delete(cmd);
  return err == ESP_OK;
}

bool ESP32S3BoxLiteAudio::initEs8156() {
  const uint8_t sequence[][2] = {
      {0x02, 0x04}, {0x20, 0x2A}, {0x21, 0x3C}, {0x22, 0x00}, {0x24, 0x07}, {0x23, 0x00},
      {0x0A, 0x01}, {0x0B, 0x01}, {0x11, 0x00}, {0x14, 179},  {0x0D, 0x14}, {0x18, 0x00},
      {0x08, 0x3F}, {0x00, 0x02}, {0x00, 0x03}, {0x25, 0x20},
  };
  for (const auto &item : sequence) {
    if (!writeRegister(kEs8156Address, item[0], item[1])) { return false; }
  }
  digitalWrite(kPowerAmpPin, HIGH);
  return true;
}

bool ESP32S3BoxLiteAudio::startEs8156() {
  const uint8_t sequence[][2] = {
      {0x08, 0x3F}, {0x09, 0x00}, {0x18, 0x00}, {0x25, 0x20}, {0x22, 0x00},
      {0x21, 0x3C}, {0x19, 0x20}, {0x14, 179},
  };
  for (const auto &item : sequence) {
    if (!writeRegister(kEs8156Address, item[0], item[1])) { return false; }
  }
  digitalWrite(kPowerAmpPin, HIGH);
  return true;
}

bool ESP32S3BoxLiteAudio::initEs7243e() {
  const uint8_t sequence[][2] = {
      {0x01, 0x3A}, {0x00, 0x80}, {0xF9, 0x00}, {0x04, 0x02}, {0x04, 0x01}, {0xF9, 0x01},
      {0x00, 0x1E}, {0x01, 0x00}, {0x02, 0x00}, {0x03, 0x20}, {0x04, 0x01}, {0x0D, 0x00},
      {0x05, 0x00}, {0x06, 0x03}, {0x07, 0x00}, {0x08, 0xFF}, {0x09, 0xCA}, {0x0A, 0x85},
      {0x0B, 0x00}, {0x0E, 0xBF}, {0x0F, 0x80}, {0x14, 0x0C}, {0x15, 0x0C}, {0x17, 0x02},
      {0x18, 0x26}, {0x19, 0x77}, {0x1A, 0xF4}, {0x1B, 0x66}, {0x1C, 0x44}, {0x1E, 0x00},
      {0x1F, 0x0C}, {0x20, 0x1A}, {0x21, 0x1A}, {0x00, 0x80}, {0x01, 0x3A}, {0x16, 0x3F},
      {0x16, 0x00}, {0xF9, 0x00}, {0x04, 0x01}, {0x17, 0x01}, {0x20, 0x10}, {0x21, 0x10},
      {0x00, 0x80}, {0x01, 0x3A}, {0x16, 0x3F}, {0x16, 0x00},
  };
  for (const auto &item : sequence) {
    if (!writeRegister(kEs7243eAddress, item[0], item[1])) { return false; }
  }
  return true;
}

uint8_t ESP32S3BoxLiteAudio::micGainRegister(float db) const {
  db += 0.5f;
  if (db <= 33.0f) { return static_cast<uint8_t>(db / 3.0f); }
  if (db < 36.0f)  { return 12; }
  if (db < 37.0f)  { return 13; }
  return 14;
}

bool ESP32S3BoxLiteAudio::setSpeakerVolumePercent(uint8_t percent) {
  volumePercent_ = std::min<uint8_t>(percent, 100);
  const uint8_t regValue = static_cast<uint8_t>((static_cast<uint16_t>(volumePercent_) * 255U) / 100U);
  return writeRegister(kEs8156Address, 0x14, regValue);
}

bool ESP32S3BoxLiteAudio::setMicGainDb(uint8_t db) {
  micGainDb_ = db;
  const uint8_t reg = static_cast<uint8_t>(0x10 | micGainRegister(static_cast<float>(db)));
  return writeRegister(kEs7243eAddress, 0x20, reg) && writeRegister(kEs7243eAddress, 0x21, reg);
}

bool ESP32S3BoxLiteAudio::playBeep(int frequencyHz, int durationMs) {
  if (!initialized_ || frequencyHz <= 0 || durationMs <= 0) { return false; }

  constexpr size_t kChunkSamples = 256;
  int16_t buffer[kChunkSamples];
  const int totalSamples = static_cast<int>((sampleRate() * static_cast<uint32_t>(durationMs)) / 1000U);
  float phase = 0.0f;
  const float phaseStep = (2.0f * kPi * static_cast<float>(frequencyHz)) / static_cast<float>(sampleRate());

  int samplesLeft = totalSamples;
  while (samplesLeft > 0) {
    const int chunkSamples = std::min<int>(samplesLeft, static_cast<int>(kChunkSamples));
    for (int i = 0; i < chunkSamples; ++i) {
      const float position = static_cast<float>(totalSamples - samplesLeft + i) / static_cast<float>(totalSamples);
      float envelope = 1.0f;
      if (position < 0.08f) {
        envelope = position / 0.08f;
      } else if (position > 0.85f) {
        envelope = (1.0f - position) / 0.15f;
      }
      envelope = std::max(0.0f, envelope);
      buffer[i] = static_cast<int16_t>(std::sin(phase) * 12000.0f * envelope);
      phase += phaseStep;
      if (phase > 2.0f * kPi) { phase -= 2.0f * kPi; }
    }
    if (writeSpeakerSamples(buffer, static_cast<size_t>(chunkSamples)) != static_cast<size_t>(chunkSamples)) {
      return false;
    }
    samplesLeft -= chunkSamples;
  }

  memset(buffer, 0, sizeof(buffer));
  writeSpeakerSamples(buffer, kChunkSamples / 2);
  return true;
}

size_t ESP32S3BoxLiteAudio::readMicSamples(int16_t *buffer, size_t sampleCount) {
  if (!initialized_ || buffer == nullptr || sampleCount == 0) { return 0; }

  size_t bytesRead = 0;
  const size_t requestedBytes = sampleCount * sizeof(int16_t);
  const esp_err_t err = i2s_read(static_cast<i2s_port_t>(kI2sPort), buffer, requestedBytes, &bytesRead, portMAX_DELAY);
  if (err != ESP_OK) { return 0; }
  return bytesRead / sizeof(int16_t);
}

