Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
size_t ESP32S3BoxLiteAudio::writeSpeakerSamples(const int16_t *buffer, size_t sampleCount) {
  if (!initialized_ || buffer == nullptr || sampleCount == 0) { return 0; }

  size_t bytesWritten = 0;
  const size_t requestedBytes = sampleCount * sizeof(int16_t);
  const esp_err_t err = i2s_write(static_cast<i2s_port_t>(kI2sPort), buffer, requestedBytes, &bytesWritten, portMAX_DELAY);
  if (err != ESP_OK) { return 0; }
  return bytesWritten / sizeof(int16_t);
}

int ESP32S3BoxLiteAudio::samplesToLevelPercent(const int16_t *buffer, size_t sampleCount) const {
  if (buffer == nullptr || sampleCount == 0) { return 0; }
  int peak = 0;
  for (size_t i = 0; i < sampleCount; ++i) {
    const int value = buffer[i] < 0 ? -buffer[i] : buffer[i];
    if (value > peak) { peak = value; }
  }
  return std::min(100, (peak * 100) / 32767);
}

// Phase 4 additions

bool ESP32S3BoxLiteAudio::playWav(const uint8_t *data, size_t len) {
  if (!initialized_ || data == nullptr || len == 0) { return false; }

  const WavHeader h = parseWavHeader(data, len);
  if (!h.valid) { return false; }
  if (h.bitsPerSample != 16) { return false; }
  if (h.dataOffset + h.dataSize > len) { return false; }

  // If sample rate differs from current, update I2S
  if (h.sampleRate != currentSampleRate_) {
    currentSampleRate_ = h.sampleRate;
    i2s_set_sample_rates(static_cast<i2s_port_t>(kI2sPort), currentSampleRate_);
  }

  const int16_t *samples    = reinterpret_cast<const int16_t *>(data + h.dataOffset);
  size_t         totalSamps = h.dataSize / sizeof(int16_t);

  // For stereo, we send as-is (the I2S is mono left channel; stereo data will
  // play both L and R via interleaved samples on a mono bus - acceptable behaviour)
  constexpr size_t kChunk = 512;
  size_t offset = 0;
  while (offset < totalSamps) {
    const size_t count = std::min<size_t>(totalSamps - offset, kChunk);
    if (writeSpeakerSamples(samples + offset, count) == 0) { return false; }
    offset += count;
  }

  // Silence tail
  int16_t silence[32] = {};
  writeSpeakerSamples(silence, 32);
  return true;
}

bool ESP32S3BoxLiteAudio::setVolumeFade(uint8_t targetPercent, uint32_t durationMs) {
  if (!initialized_) { return false; }
  const uint8_t startPercent = volumePercent_;
  const uint8_t endPercent   = targetPercent > 100 ? 100 : targetPercent;

  if (durationMs == 0 || startPercent == endPercent) {
    return setSpeakerVolumePercent(endPercent);
  }

  constexpr uint32_t kSteps = 20;
  const uint32_t stepDelayMs = durationMs / kSteps;
  const int32_t  delta       = static_cast<int32_t>(endPercent) - static_cast<int32_t>(startPercent);

  for (uint32_t i = 1; i <= kSteps; ++i) {
    const uint8_t vol = static_cast<uint8_t>(startPercent + (delta * static_cast<int32_t>(i)) / static_cast<int32_t>(kSteps));
    if (!setSpeakerVolumePercent(vol)) { return false; }
    delay(stepDelayMs);
  }
  return setSpeakerVolumePercent(endPercent);
}

void ESP32S3BoxLiteAudio::setMute(bool mute) {
  muted_ = mute;
  // GPIO46 is speaker amp enable: HIGH = enabled, LOW = muted
  digitalWrite(kPowerAmpPin, mute ? LOW : HIGH);
}

void ESP32S3BoxLiteAudio::muteToggle() {
  setMute(!muted_);
}

bool ESP32S3BoxLiteAudio::beepPattern(BeepPattern pattern) {
  if (!initialized_) { return false; }
  switch (pattern) {
    case BeepPattern::OK:
      return playBeep(880, 100) && playBeep(1100, 150);
    case BeepPattern::Error:
      return playBeep(400, 200) && playBeep(300, 300);
    case BeepPattern::Double:
      return playBeep(660, 100) && playBeep(660, 100);
    case BeepPattern::Triple:
      return playBeep(660, 80) && playBeep(660, 80) && playBeep(880, 120);
    default:
      return false;
  }
}

int ESP32S3BoxLiteAudio::getMicLevelPercent() {
  if (!initialized_) { return 0; }
  constexpr size_t kSamples = 64;
  int16_t buf[kSamples];

  size_t bytesRead = 0;
  // Short timeout (non-blocking: 10ms timeout)
  const esp_err_t err = i2s_read(static_cast<i2s_port_t>(kI2sPort), buf, kSamples * sizeof(int16_t),
                                  &bytesRead, pdMS_TO_TICKS(10));
  if (err != ESP_OK || bytesRead == 0) { return 0; }
  return samplesToLevelPercent(buf, bytesRead / sizeof(int16_t));
}

float ESP32S3BoxLiteAudio::getMicPeakDb() {
  if (!initialized_) { return -120.0f; }
  constexpr size_t kSamples = 64;
  int16_t buf[kSamples];

  size_t bytesRead = 0;
  const esp_err_t err = i2s_read(static_cast<i2s_port_t>(kI2sPort), buf, kSamples * sizeof(int16_t),
                                  &bytesRead, pdMS_TO_TICKS(10));
  if (err != ESP_OK || bytesRead == 0) { return -120.0f; }

  const size_t n = bytesRead / sizeof(int16_t);
  int peak = 0;
  for (size_t i = 0; i < n; ++i) {
    const int v = buf[i] < 0 ? -buf[i] : buf[i];
    if (v > peak) { peak = v; }
  }
  if (peak == 0) { return -120.0f; }
  return 20.0f * std::log10(static_cast<float>(peak) / 32767.0f);
}

bool ESP32S3BoxLiteAudio::setSampleRate(uint32_t hz) {
  if (!initialized_ || hz == 0) { return false; }
  currentSampleRate_ = hz;
  const esp_err_t err = i2s_set_sample_rates(static_cast<i2s_port_t>(kI2sPort), hz);
  return err == ESP_OK;
}

// Phase 5 - Recording & SPIFFS

bool ESP32S3BoxLiteAudio::startMicRecord(int16_t *buffer, size_t maxSamples) {
  if (!initialized_ || buffer == nullptr || maxSamples == 0) { return false; }
  recordBuffer_     = buffer;
  recordMaxSamples_ = maxSamples;
  recordedSamples_  = 0;
  recording_        = true;
  return true;
}

size_t ESP32S3BoxLiteAudio::stopMicRecord() {
  if (!recording_) { return recordedSamples_; }

  // Read remaining samples from I2S into the buffer
  while (recording_ && recordedSamples_ < recordMaxSamples_) {
    const size_t remaining = recordMaxSamples_ - recordedSamples_;
    const size_t chunk     = std::min<size_t>(remaining, 256U);

    size_t bytesRead = 0;
    const esp_err_t err = i2s_read(static_cast<i2s_port_t>(kI2sPort),
                                    recordBuffer_ + recordedSamples_,
                                    chunk * sizeof(int16_t),
                                    &bytesRead,
                                    pdMS_TO_TICKS(50));
    if (err != ESP_OK || bytesRead == 0) { break; }
    recordedSamples_ += bytesRead / sizeof(int16_t);
  }

  recording_    = false;
  recordBuffer_ = nullptr;
  return recordedSamples_;
}

bool ESP32S3BoxLiteAudio::playWavFromSPIFFS(const char *path) {
  if (!initialized_ || path == nullptr) { return false; }

  if (!SPIFFS.begin(true)) { return false; }

  File f = SPIFFS.open(path, FILE_READ);
  if (!f) { return false; }

