Xenoah/ESP32-bambu-MQTT/lib/ESP32S3BoxLiteEasy/src/ESP32S3BoxLite.cpp
  const size_t fileSize = f.size();
  if (fileSize == 0) { f.close(); return false; }

  // Allocate buffer (try PSRAM first)
  uint8_t *buf = nullptr;
  if (esp_spiram_is_initialized()) {
    buf = static_cast<uint8_t *>(heap_caps_malloc(fileSize, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  }
  if (buf == nullptr) {
    buf = static_cast<uint8_t *>(heap_caps_malloc(fileSize, MALLOC_CAP_8BIT));
  }
  if (buf == nullptr) { f.close(); return false; }

  f.read(buf, fileSize);
  f.close();

  const bool result = playWav(buf, fileSize);
  heap_caps_free(buf);
  return result;
}

bool ESP32S3BoxLiteAudio::saveMicToSPIFFS(const char *path, const int16_t *samples, size_t count) {
  if (path == nullptr || samples == nullptr || count == 0) { return false; }

  if (!SPIFFS.begin(true)) { return false; }

  File f = SPIFFS.open(path, FILE_WRITE);
  if (!f) { return false; }

  const bool ok = writeWavFile(f, samples, count, currentSampleRate_);
  f.close();
  return ok;
}

// ===========================================================================
// ESP32S3BoxLite main class
// ===========================================================================

bool ESP32S3BoxLite::begin(bool withDisplay, bool withInput, bool withAudio) {
  bool ok = true;
  if (withDisplay) { ok = display_.begin() && ok; }
  if (withInput)   { ok = input_.begin()   && ok; }
  if (withAudio)   { ok = audio_.begin()   && ok; }
  return ok;
}

ESP32S3BoxLiteDisplay &ESP32S3BoxLite::display() { return display_; }
ESP32S3BoxLiteInput   &ESP32S3BoxLite::input()   { return input_;   }
ESP32S3BoxLiteAudio   &ESP32S3BoxLite::audio()   { return audio_;   }

// Phase 6 - Power management

void ESP32S3BoxLite::enterLightSleep(uint32_t wakeupGpioMask) {
  // Configure GPIO wakeup sources
  if (wakeupGpioMask != 0) {
    for (int pin = 0; pin < 48; ++pin) {
      if (wakeupGpioMask & (1U << pin)) {
        gpio_wakeup_enable(static_cast<gpio_num_t>(pin), GPIO_INTR_LOW_LEVEL);
      }
    }
    esp_sleep_enable_gpio_wakeup();
  }
  esp_light_sleep_start();
}

void ESP32S3BoxLite::enterDeepSleep(uint64_t wakeupTimerUs) {
  if (wakeupTimerUs > 0) {
    esp_sleep_enable_timer_wakeup(wakeupTimerUs);
  }
  esp_deep_sleep_start();
}

const char *ESP32S3BoxLite::getWakeupReason() {
  switch (esp_sleep_get_wakeup_cause()) {
    case ESP_SLEEP_WAKEUP_TIMER:       return "TIMER";
    case ESP_SLEEP_WAKEUP_GPIO:        return "GPIO";
    case ESP_SLEEP_WAKEUP_UART:        return "UART";
    case ESP_SLEEP_WAKEUP_EXT0:        return "EXT0";
    case ESP_SLEEP_WAKEUP_EXT1:        return "EXT1";
    case ESP_SLEEP_WAKEUP_TOUCHPAD:    return "TOUCHPAD";
    case ESP_SLEEP_WAKEUP_ULP:         return "ULP";
    case ESP_SLEEP_WAKEUP_UNDEFINED:
    default:                           return "NONE";
  }
}

// Phase 6 - NVS helpers

bool ESP32S3BoxLite::nvsOpen(void **outHandle) {
  // Initialize NVS flash if needed
  esp_err_t err = nvs_flash_init();
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    nvs_flash_erase();
    err = nvs_flash_init();
  }
  if (err != ESP_OK) { return false; }

  nvs_handle_t handle;
  err = nvs_open(kNvsNamespace, NVS_READWRITE, &handle);
  if (err != ESP_OK) { return false; }
  *outHandle = reinterpret_cast<void *>(static_cast<uintptr_t>(handle));
  return true;
}

bool ESP32S3BoxLite::nvsSetInt(const char *key, int32_t value) {
  void *h = nullptr;
  if (!nvsOpen(&h)) { return false; }
  const nvs_handle_t handle = static_cast<nvs_handle_t>(reinterpret_cast<uintptr_t>(h));
  const esp_err_t err = nvs_set_i32(handle, key, value);
  nvs_commit(handle);
  nvs_close(handle);
  return err == ESP_OK;
}

int32_t ESP32S3BoxLite::nvsGetInt(const char *key, int32_t defaultValue) {
  void *h = nullptr;
  if (!nvsOpen(&h)) { return defaultValue; }
  const nvs_handle_t handle = static_cast<nvs_handle_t>(reinterpret_cast<uintptr_t>(h));
  int32_t value = defaultValue;
  nvs_get_i32(handle, key, &value);
  nvs_close(handle);
  return value;
}

bool ESP32S3BoxLite::nvsSetStr(const char *key, const char *value) {
  void *h = nullptr;
  if (!nvsOpen(&h)) { return false; }
  const nvs_handle_t handle = static_cast<nvs_handle_t>(reinterpret_cast<uintptr_t>(h));
  const esp_err_t err = nvs_set_str(handle, key, value);
  nvs_commit(handle);
  nvs_close(handle);
  return err == ESP_OK;
}

bool ESP32S3BoxLite::nvsGetStr(const char *key, char *buf, size_t bufLen) {
  void *h = nullptr;
  if (!nvsOpen(&h)) { return false; }
  const nvs_handle_t handle = static_cast<nvs_handle_t>(reinterpret_cast<uintptr_t>(h));
  size_t requiredLen = bufLen;
  const esp_err_t err = nvs_get_str(handle, key, buf, &requiredLen);
  nvs_close(handle);
  return err == ESP_OK;
}

// Phase 6 - System info

uint32_t ESP32S3BoxLite::getFreeHeap() {
  return static_cast<uint32_t>(heap_caps_get_free_size(MALLOC_CAP_DEFAULT));
}

uint32_t ESP32S3BoxLite::getCpuFreqMHz() {
  return static_cast<uint32_t>(getCpuFrequencyMhz());
}

const char *ESP32S3BoxLite::getResetReason() {
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON:   return "POWER_ON";
    case ESP_RST_EXT:       return "EXT_RESET";
    case ESP_RST_SW:        return "SOFTWARE";
    case ESP_RST_PANIC:     return "PANIC";
    case ESP_RST_INT_WDT:   return "INT_WDT";
    case ESP_RST_TASK_WDT:  return "TASK_WDT";
    case ESP_RST_WDT:       return "WDT";
    case ESP_RST_DEEPSLEEP: return "DEEP_SLEEP";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_SDIO:      return "SDIO";
    case ESP_RST_UNKNOWN:
    default:                return "UNKNOWN";
  }
}
